Show / Hide Table of Contents
Class PolyLine3D
Represents a polyline in three-dimensional space.
Inheritance
System.Object
OpenObject
OpenElementId
PolyLine3D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.PolyLine3D,CI.Geometry3D", "CI.Geometry3D.IPolyLine3D,CI.BasicTypes")]
public class PolyLine3D : OpenElementId
Constructors
Improve this Doc   View Source
PolyLine3D()
Contructor
Declaration
public PolyLine3D()
Properties
Improve this Doc   View Source
Segments
Gets or sets list of references to Segment3D of PolyLine3D.
Declaration
public List<ReferenceElement> Segments { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
 Improve this Doc
 View Source